// Online C++ compiler to run C++ program online
#include <iostream>
#include <algorithm>
#include <string>
#include <clocale>

using namespace std;
int main() {
   
    string alphabet1 = "АБВГДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ";
    string alphabet2 = "МНОПРСТУФХЦЧШЩЬЮЯАБВГДЕЄЖЗИЇЙКЛ";
	string text = "ЕЯШТГШЮДУЕЯЧЄЧКВВТБШФМЦВЕБВРБЧИШТУЬЮОБЄВДШРЕЛЮВЩЄУ ВДШЩАБВХЧБПЖРДВЦСЯНТАБВХЧБЧНЮБВРВСВЕОАВЕЄШЬБВСВВПФЮ ЄОАОЄУАОЄЧЇБВСВТВЕЯШТХУББНЄВАЖБУВПИШТБВДВЦДШЦБНЄЧЄОЮ ШТРОДШЦБШВПФЮЄЧНЮУЯУАУБЄШАБВХЧБОНЮОЕЮЯОТОФЄЛЕНЦФТ ЧБВСВУЯУАУБЄОЦВЮДУАОАБВХЧБЧАВХЖЄЛРЧЕЄЖГОЄЧРДВЯШУЯУАУ БЄШРНЮВЩЕЛШБЙВЩАБВХЧБЧТДЖСЧЬЕГВЕШПЦОТОББНАБВХЧБСДЖБ ЄЖФЄЛЕНБОЦОЦБОЇУББШЦОСОЯЛБВЩРЯОЕЄЧРВЕЄШОПВГВДВТХЖРОЯ ЛБВЩГДВІУТЖДЧТЯНРЕШИВПФЮЄШРКВЖЄРВДММЄЛВГЧЕЖРОБЖАБВХ ЧБЖЄОЮЧЬРЧДОЦЇЧЄОФЄЛЕНЄОЮАБВХЧБОРЕШИЄОЮЧИУЯУАУБЄШРТЯ ННЮЧИРЧЮВБЖФЄЛЕНРЯОЕЄЧРШЕЄЛЦОЦБОЇУБЖРЯОЕЄЧРШЕЄЛАОМЄЛ РЕШУЯУАУБЄЧАБВХЧБЧШЄШЯЛЮЧРВБЧЦОАШЕЄЛРУДЄЧЮОЯЛБВЩДЧЕ ЮЧШБВТШЦОГЧЕЖМЄЛТРВЮДОГЮЖІУЬЕГВЕШПФПШЯЛЙЦОСОЯЛБЧАЕ ГВЕВПВАЦОТОББНАБВХЧБ";
	
	for(int i = 0; i < alphabet1.length(); i++)
	{
		replace(text.begin(), text.end(), alphabet1[i], alphabet2[i]);
	}
	cout << text;
    return 0;
}
